translate = {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'yo', 'ж': 'j', 'з': 'z', 'и': 'i',
             'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f',
             'х': 'kh', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'sch', 'ъ': '', 'ы': 'y', 'ь': '\'', 'э': 'e',
             'ю': 'yu', 'я': 'ya'}

male_names = ['Аркадий', 'Андрей', 'Артур', 'Антон', 'Артём', 'Александр', 'Алексей', 'Анатолий', 'Борис', 'Борислав',
              'Вадим', 'Виктор', 'Виталий', 'Владимир', 'Василий', 'Всеволод', 'Владислав', 'Вячеслав', 'Глеб',
              'Геннадий', 'Георгий', 'Григорий', 'Дамир', 'Дмитрий', 'Даниил', 'Данила', 'Денис', 'Евгений', 'Егор',
              'Иван', 'Игорь', 'Илья', 'Константин', 'Кирилл', 'Леонид', 'Максим', 'Макар', 'Михаил', 'Мирослав',
              'Никита', 'Николай', 'Олег', 'Пётр', 'Павел', 'Роман', 'Руслан', 'Святослав', 'Сергей', 'Савва',
              'Сидр', 'Семён', 'Степан', 'Фёдор', 'Филипп', 'Юрий', 'Яков', 'Ярослав']

female_names = ['Алина', 'Анжелика', 'Алла', 'Арина', 'Анастасия', 'Анна', 'Алёна', 'Валерия', 'Влада', 'Василиса',
                'Вера', 'Виктория', 'Дина', 'Дария', 'Дарина', 'Елизавета', 'Евгения', 'Екатерина', 'Елена', 'Злата',
                'Инесса', 'Ирина', 'Инна', 'Карина', 'Кира', 'Ксения', 'Лера', 'Любовь', 'Лариса', 'Лидия', 'Людмила',
                'Мария', 'Милена', 'Мирра', 'Маргарита', 'Милана', 'Марина', 'Надежда', 'Наталья', 'Нина', 'Нелли',
                'Оксана', 'Ольга', 'Олеся', 'Полина', 'Светлана', 'Софья', 'Татьяна', 'Ульяна', 'Юлия', 'Яна']

surname_prefix = ['кис', 'кол', 'леб', 'пен', 'стам', 'стык', 'дан', 'тер', 'клер', 'фет', 'фа', 'хоп', 'лук']
surname_root = ['аше', 'ета', 'лен', 'ушу', 'оло', 'ато', 'ыка']
surname_suffix_male = ['ко', 'ло', 'вич', 'тин', 'сян', 'чан', 'вен', 'пов', 'тев', 'тин', 'лан', 'ный', 'кий']
surname_suffix_female = ['ко', 'вич', 'ина', 'тева', 'лова', 'тина', 'ная', 'кая', 'сян', 'чан']

email_domen = ['gmail.com', 'yandex.ru', 'ya.ru', 'yahoo.com', 'list.me', 'mail.ru', 'rambler.com',
               'inbox.ru', 'me.com', 'icloud.com']

countries = ['Россия', 'США', 'Франция', 'Италия', 'Испания', 'Греция', 'Норвегия', 'Швеция', 'Эстония', 'Латвия',
             'Литва', 'Финляндия', 'Дания', 'Исландия', 'Канада', 'Египет', 'Мексика', 'Украина', 'Белоруссия',
             'Армения', 'Грузия', 'Монголия', 'Китай', 'Австралия', 'Новая зеландия', 'Индия', 'Шри-Ланка', 'Таиланд',
             'Малайзия', 'Индонезия', 'Вьетнам', 'Лаос', 'Камбоджа', 'Япония', 'Израиль', 'Иордания', 'Фиджи', 'Палау',
             'Маврикий', 'Мальдивы', 'Сейшелы', 'Мальта', 'Швейцария', 'Германия', 'Нидерланды', 'Великобритания',
             'Казахстан', 'Турция', 'Болгария', 'Румыния', 'Венгрия', 'Бразилия', 'Аргентина', 'Уругвай', 'Парагвай',
             'Чили', 'Венесуэлла', 'Коста-Рика', 'ЮАР', 'Бруней', 'Непал', 'Пакистан']

city_prefix = ['нью', 'красно', 'санкт', 'бел', 'зелено', 'лесо', 'рос', 'воло', 'вар', 'ново', 'роттер', 'амстер',
               'крон', 'лейп', 'мос', 'барс', 'лисса']
city_suffix = ['град', 'город', 'ярск', 'ламск', 'бирск', 'омск', 'гама', 'стан', 'лёв', 'дам', 'синки', 'овск',
               'атск', 'бург', 'дорф', 'штадт', 'ква', 'риж', 'елона', 'бон']

locations = ['лес', 'дом', 'замок', 'двор', 'забор', 'мост', 'здание', 'пруд', 'озеро', 'море', 'статуя', 'ратуша',
             'дерево', 'фонтан', 'площадь', 'улица', 'переулок', 'улочка', 'скала', 'гора', 'уступ', 'склон', 'могила',
             'гараж', 'магазин', 'ресторан', 'дорожка', 'набережная', 'серпантин', 'фонарь', 'речка', 'ручей', 'офис',
             'поместье', 'дача', 'аэропорт', 'пристань']
